### R Program

### 問題1:誤差 
d <- matrix(0,3,3) # 要素が0の3行3列の行列
d[1,] <- c(-29,92,70)
d[2,] <- c(53,-10,59)
d[3,] <- c(70,47,-43)
u <- mean(d) # 全平均
m <- matrix(0,3,3) # 平均
rownames(m) <- c('A', 'B', 'C')
colnames(m) <- c(1:3)
for (i in 1:3) m[1, i] <- mean(d[,i])
for (i in 1:3) m[2, i] <- mean(d[i,])
m[3,] <- c(
           mean(c(d[1,1], d[2,2], d[3,3])),
           mean(c(d[1,2], d[2,3], d[3,1])),
           mean(c(d[1,3], d[2,1], d[3,2]))
           )

ef <- m - u # 主効果
##           1          2         3
## A  -3.00000  8.6666667 -5.666667
## B  10.00000 -0.3333333 -9.666667
## C -61.66667 39.3333333 22.333333

efm <- matrix(0,3,3)
efm[1,] <- c(
             ef[1,1] + ef[2,1] + ef[3,1],
             ef[1,2] + ef[2,1] + ef[3,2],
             ef[1,3] + ef[2,1] + ef[3,3]
             )
efm[2,] <- c(
             ef[1,1] + ef[2,2] + ef[3,3],
             ef[1,2] + ef[2,2] + ef[3,1],
             ef[1,3] + ef[2,2] + ef[3,2]
             )
efm[3,] <- c(
             ef[1,1] + ef[2,3] + ef[3,2],
             ef[1,2] + ef[2,3] + ef[3,3],
             ef[1,3] + ef[2,3] + ef[3,1]
             )
e <- d - (u + efm) # 誤差
## -8.7  -0.33  9.0
## -0.33  9.0  -8.7
##  9.0  -8.7  -0.33


### 問題2:一元配置法
a <- list(
          c(16.6, 17.0, 21.4, 25.0, 24.2, 23.7, 20.0, 22.4, 24.4, 24.9),
          c(21.1, 24.2, 20.8, 21.0, 17.0, 23.4, 16.2, 23.2, 17.2, 19.9),
          c(16.8, 19.4, 15.1, 18.7, 17.8, 23.2, 14.8, 19.9, 18.4),
          c(21.2, 20.1, 18.4, 17.1, 22.9, 25.0, 25.4, 24.7),
          c(22.1, 18.5, 19.3, 17.5, 19.1, 13.7, 22.4, 20.5)
)
l <- sapply (a, function(x) length(x)) # 腹別標本サイズ
N <- sum(l) # 標本サイズ
sum <- sum(sapply(a, function(x) sum(x))) # 総和
m <- sum / N # 全平均
X <- sapply (a, function(x) mean(x)) # 腹別標本平均
# 21.96000 20.40000 18.23333 21.85000 19.13750

s_e <- sum(sapply(1:5, function(i) sum(sapply (a[[i]], function(x) sum(x-X[i])^2)))) # 誤差変動 338.1027
v_e <- s_e / (N-5) # 誤差不偏分散 8.452569
err <- sapply(1:5, function(i) t_lim[i] * sqrt(v_e / l[i])) # 誤差
min <- X + err
max <- X - err
# 95%信頼区間は以下の通り。
#     A  B  C  D  E
# min 20 19 16 20 17
# max 24 22 20 24 21

t_lim <- abs(qt(0.025, N - 5)) # 誤差のt基準値
lsd <- matrix(0,5,5) # 最小有意差
ab <- matrix(0,5,5) # 平均値差
for (i in 1:4) {
  for (j in (i+1):5) {
    lsd[i,j] <- (t_lim * sqrt((1/l[i] + 1/l[j]) * v_e))
    lsd[j,i] <- lsd[i,j]
    ab[i,j] <- abs(X[i]-X[j])
    ab[j,i] <- abs[i,j]
  }
}

result <- ab - lsd
##             [,1]       [,2]       [,3]       [,4]        [,5]
## [1,]  0.00000000 -1.0677973  1.0268616 -2.6772000  0.03530003
## [2,] -1.06779733  0.0000000 -0.5331384 -1.3372000 -1.52469997
## [3,]  1.02686155 -0.5331384  0.0000000  0.7614762 -1.95102378
## [4,] -2.67719997 -1.3372000  0.7614762  0.0000000 -0.22546673
## [5,]  0.03530003 -1.5247000 -1.9510238 -0.2254667  0.00000000
# この中で正になっている値を探すと, A1-A3, A1-A5, A3-A4の各水準間に有意差が認められる。
